import os
import shutil

# 定义需要复制的文件夹路径和目标文件夹路径
src_folder = './A'
dst_folder = './B'

# 定义需要选中的序号列表
selected_indices = [296, 81, 77, 208, 318, 277, 244, 323, 284, 120, 158, 165, 395, 422, 231, 118, 133, 239,
                    199, 131, 54, 671, 377, 355, 97, 227, 424, 78, 393, 109, 63, 408, 367, 512, 497, 286,
                    539, 196, 346, 182, 174, 545, 306, 469, 192, 547, 691, 248, 467, 10, 426, 234, 430, 514,
                    328, 84, 417, 582, 654, 535, 656, 517, 361, 609, 338, 506, 659, 697, 544, 86, 72, 31,
                    290, 686, 613, 620, 145, 220, 55, 329, 331, 567, 76, 2, 259, 260, 380, 699, 332, 319,
                    396, 700, 213, 409, 101, 569, 631, 90, 181, 310, 60, 625, 30, 69, 257, 235, 44, 275,
                    70, 164, 683, 212, 136, 211, 515, 148, 405, 333, 583, 314, 65, 399, 49, 647, 135, 39,
                    335, 521, 6, 209, 356, 302, 369, 132, 479, 41, 108, 256, 56, 494, 519]

# 将序号列表转换成文件名列表
selected_filenames = [str(idx) + '.png' for idx in selected_indices]

# 遍历所有的文件名，如果文件名包含在需要的序号列表中，则复制该文件到指定目录中
for filename in os.listdir(src_folder):
    if filename in selected_filenames:
        src_path = os.path.join(src_folder, filename)
        dst_path = os.path.join(dst_folder, filename)
        shutil.copy(src_path, dst_path)